app/Controllers/Transaction.php

    public function index()
    {
		$transactionModel = new \App\Models\TransactionModel();
		$customerModel = new \App\Models\CustomerModel();
		$productModel = new \App\Models\ProductModel();
		$data['transaction'] = $transactionModel->findall();
---
SELECT *
FROM `transaction`

	public function getAll()
    {
		$transactionModel = new \App\Models\TransactionModel();
		$list = $transactionModel->findall();
---
SELECT *
FROM `transaction`