app/Models/CustomerModel.php

SELECT `customer_name`
FROM `customer`
---
    public function customer_name()
    {
        $result = $this->select('customer_name')
		->findAll();