app/Models/ProductModel.php

	public function product_name()
    {
        $result = $this->select('product_name')
		->findAll();
---
SELECT `product_name`
FROM `product`